Repository: bb-io/Taus
Catalog: Tests.Taus/TestFiles/Input/About Us_*.html.xliff
Languages: es

# /html[1]/body[1]/div[1]/h1[1]
source: About Us
es: Quiénes somos

# /html[1]/body[1]/div[1]/div[1]/p[1]
source: Argo Translation has been providing exceptional tailored translation solutions for more than 28 years — whether it’s to help companies sell more products to an international audience or to clearly engage with employees through a variety of languages. With a focus on communicating with the client at a personal level, even as technology continues to be more advanced, we continue to uphold the same spirit of great customer service that the company began with as we continue to create understanding in every language around the world.
es: Argo Translation lleva más de 28 años ofreciendo excepcionales soluciones de traducción a medida, ya sea para ayudar a las empresas a vender más productos a un público internacional o para relacionarse claramente con los empleados a través de una variedad de idiomas. Con un enfoque en la comunicación con el cliente a nivel personal, incluso cuando la tecnología sigue siendo más avanzada, seguimos manteniendo el mismo espíritu de gran servicio al cliente con el que comenzó la empresa mientras seguimos creando entendimiento en todos los idiomas del mundo.

# /html[1]/body[1]/div[1]/div[1]/p[2]
source: {1}Our History
es: {2}Nuestra historia

# /html[1]/body[1]/div[1]/div[1]/p[3]
source: CEO Peter Argondizzo envisioned Argo Translation during his first job out of college. As a project manager in the foreign language department of a medical device company, he grew frustrated with the translation process—the costs and the lack of accountability among companies offering translation services. “We can do better than that,” he thought. This is a new sentence.
es: Peter Argondizzo, director general, concibió Argo Translation durante su primer trabajo al salir de la universidad. Como gestor de proyectos en el departamento de lenguas extranjeras de una empresa de dispositivos médicos, se sintió frustrado con el proceso de traducción: los costes y la falta de responsabilidad de las empresas que ofrecían servicios de traducción. "Podemos hacerlo mejor", pensó. Esta es una nueva frase.

# /html[1]/body[1]/div[1]/div[1]/p[4]
source: Peter partnered with co-founder Jackie Lucarelli, and together, they grew Argo Translation to more than two dozen full-time employees who coordinate more than 300 translators worldwide. Bringing their combined customer service, translation, and corporate skills together, Peter and Jackie built Argo Translation not just on the constantly advancing technology in the industry but also on the human touch with every project. Personally being involved in every project provides a better relationship with both translators and customers, resulting in the best possible project outcome. Argo Translation continues to work with many of its original customers and is proud to continue to practice these work ethics every single day.
es: Peter se asoció con la cofundadora Jackie Lucarelli y, juntos, hicieron crecer Argo Translation hasta contar con más de dos docenas de empleados a tiempo completo que coordinan a más de 300 traductores en todo el mundo. Peter y Jackie combinaron sus conocimientos de atención al cliente, traducción y empresa para construir Argo Translation no sólo sobre la base de la tecnología en constante avance del sector, sino también sobre el toque humano de cada proyecto. Involucrarse personalmente en cada proyecto permite una mejor relación tanto con los traductores como con los clientes, lo que se traduce en el mejor resultado posible del proyecto. Argo Translation sigue trabajando con muchos de sus clientes originales y se enorgullece de seguir practicando esta ética de trabajo cada día.
